app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $userId = $session->get('user_id');
        $hasUser = (bool) $userId;

        if (! $isLoggedIn || ! $hasUser) {
            return redirect()->to(site_url('/'))->with('errors', ['login' => 'Please sign in to continue.']);
        }

        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'