app/Controllers/Home.php

    public function dashboard(): string
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $hasUser = (bool) $session->get('user_id');

        if (! $isLoggedIn || ! $hasUser) {
            return redirect()->to(site_url('/'))->with('errors', ['login' => 'Please sign in to continue.']);
        }
        $plantModel = new \App\Models\PlantModel();
        $plants = $plantModel
            ->where('user_id', (int) $session->get('user_id'))
            ->orderBy('date_planted', 'DESC')
            ->findAll();
---
SELECT *
FROM `plants`
WHERE `user_id` = 3
ORDER BY `date_planted` DESC

    public function records(): string
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $hasUser = (bool) $session->get('user_id');

        if (! $isLoggedIn || ! $hasUser) {
            return redirect()->to(site_url('/'))->with('errors', ['login' => 'Please sign in to continue.']);
        }

        $plantModel = new \App\Models\PlantModel();
        $plants = $plantModel
            ->where('user_id', (int) $session->get('user_id'))
            ->orderBy('date_planted', 'DESC')
            ->findAll();
---
SELECT *
FROM `plants`
WHERE `user_id` = 3
ORDER BY `date_planted` DESC

    public function predictions(): string
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $hasUser = (bool) $session->get('user_id');

        if (! $isLoggedIn || ! $hasUser) {
            return redirect()->to(site_url('/'))->with('errors', ['login' => 'Please sign in to continue.']);
        }

        $plantModel = new \App\Models\PlantModel();
        $plants = $plantModel
            ->where('user_id', (int) $session->get('user_id'))
            ->orderBy('date_planted', 'DESC')
            ->findAll();
---
SELECT *
FROM `plants`
WHERE `user_id` = 3
ORDER BY `date_planted` DESC

    public function analytics(): string
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $hasUser = (bool) $session->get('user_id');

        if (! $isLoggedIn || ! $hasUser) {
            return redirect()->to(site_url('/'))->with('errors', ['login' => 'Please sign in to continue.']);
        }

        $userId = (int) $session->get('user_id');
        $plantModel = new \App\Models\PlantModel();
        $plants = $plantModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `plants`
WHERE `user_id` = 3

        $env = $this->getEnvironmentalData();

        $plantModel = new \App\Models\PlantModel();
        $insertId = $plantModel->insert([
            'user_id' => (int) $session->get('user_id'),
            'variety' => $variety,
            'date_planted' => $plantDate,
            'predicted_harvest' => $predictedHarvest,
            'temperature_c' => $env['temperature_c'],
            'humidity_pct' => $env['humidity_pct'],
            'tds_ppm' => $env['tds_ppm'],
            'ph_level' => $env['ph_level'],
        ], true);
---
INSERT INTO `plants` (`user_id`, `variety`, `date_planted`, `predicted_harvest`, `temperature_c`, `humidity_pct`, `tds_ppm`, `ph_level`, `created_at`, `updated_at`) VALUES (3, 'Romaine', '2026-05-07', '2026-06-06', NULL, NULL, 850, 5, '2026-05-06 10:29:48', '2026-05-06 10:29:48')

        }

        $plantModel = new \App\Models\PlantModel();
        $plant = $plantModel->find($id);
---
SELECT *
FROM `plants`
WHERE `plants`.`id` = 15

                ->setJSON(['ok' => false, 'error' => 'Plant not found.']);
        }

        $updated = $plantModel->update($id, [
            'predicted_harvest' => $predictedHarvest,
        ]);
---
UPDATE `plants` SET `predicted_harvest` = '2026-06-19', `updated_at` = '2026-05-06 10:29:07'
WHERE `plants`.`id` IN (15)

    public function deletePlant(int $id)
    {
        $session = session();
        $isLoggedIn = $session->get('is_logged_in') === true;
        $hasUser = (bool) $session->get('user_id');

        if (! $isLoggedIn || ! $hasUser) {
            return $this->response
                ->setStatusCode(401)
                ->setJSON(['ok' => false, 'error' => 'Unauthorized.']);
        }

        $plantModel = new \App\Models\PlantModel();
        $plant = $plantModel->find($id);

        if (! $plant || (int) $plant['user_id'] !== (int) $session->get('user_id')) {
            return $this->response
                ->setStatusCode(404)
                ->setJSON(['ok' => false, 'error' => 'Plant not found.']);
        }

        $deleted = $plantModel->delete($id);
---
SELECT *
FROM `plants`
WHERE `plants`.`id` = 14
DELETE FROM `plants`
WHERE `id` IN (14)